davidbramsay/watch-stm32-main-development/Watch_BLEFreeRTOS_V1/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    main.c
 * @author  MCD Application Team
 * @brief   BLE application with BLE core
 *
  @verbatim
  ==============================================================================
                    ##### IMPORTANT NOTE #####
  ==============================================================================

  This application requests having the stm32wb5x_BLE_Stack_fw.bin binary
  flashed on the Wireless Coprocessor.
  If it is not the case, you need to use STM32CubeProgrammer to load the appropriate
  binary.

  All available binaries are located under following directory:
  /Projects/STM32_Copro_Wireless_Binaries

  Refer to UM2237 to learn how to use/install STM32CubeProgrammer.
  Refer to /Projects/STM32_Copro_Wireless_Binaries/ReleaseNote.html for the
  detailed procedure to change the Wireless Coprocessor binary.

  @endverbatim
 ******************************************************************************
 * @attention
 *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. 
 * All rights reserved.</center></h2>
 *
  * This software component is licensed by ST under Ultimate Liberty license 
  * SLA0044, the "License"; You may not use this file except in compliance with 
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "app_entry.h"
#include "app_common.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_lpm.h"
#include "dbg_trace.h"
#include "hw_conf.h"
#include "otp.h"

#include "er_oled.h"
#include "dotstar.h"
#include "iqs263.h"

#define NUM_PIXELS 12
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
I2C_HandleTypeDef hi2c1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef hlpuart1;
UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_lpuart1_tx;
DMA_HandleTypeDef hdma_usart1_tx;

RTC_HandleTypeDef hrtc;

/* Definitions for defaultTask */
/* USER CODE BEGIN PV */
/* Definitions for screenUpdate */
osThreadId_t screenUpdateHandle;
const osThreadAttr_t screenUpdate_attributes = {
  .name = "screenUpdate",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 512 * 4
};
/* Definitions for LEDControl */
osThreadId_t LEDControlHandle;
const osThreadAttr_t LEDControl_attributes = {
  .name = "LEDControl",
  .priority = (osPriority_t) osPriorityBelowNormal,
  .stack_size = 128 * 4
};
/* Definitions for buttonPress */
osThreadId_t buttonPressHandle;
const osThreadAttr_t buttonPress_attributes = {
  .name = "buttonPress",
  .priority = (osPriority_t) osPriorityAboveNormal,
  .stack_size = 128 * 4
};
/* Definitions for vibrateControl */
osThreadId_t vibrateControlHandle;
const osThreadAttr_t vibrateControl_attributes = {
  .name = "vibrateControl",
  .priority = (osPriority_t) osPriorityLow,
  .stack_size = 128 * 4
};
/* Definitions for rtcSecondTick */
osThreadId_t rtcSecondTickHandle;
const osThreadAttr_t rtcSecondTick_attributes = {
  .name = "rtcSecondTick",
  .priority = (osPriority_t) osPriorityLow,
  .stack_size = 128 * 4
};
/* Definitions for bleTX */
//osThreadId_t bleTXHandle;
//const osThreadAttr_t bleTX_attributes = {
//  .name = "bleTX",
//  .priority = (osPriority_t) osPriorityLow,
//  .stack_size = 128 * 4
//};
/* Definitions for bleRX */
osThreadId_t bleRXHandle;
const osThreadAttr_t bleRX_attributes = {
  .name = "bleRX",
  .priority = (osPriority_t) osPriorityLow,
  .stack_size = 128 * 4
};
/* Definitions for LEDTimer */
osThreadId_t LEDTimerHandle;
const osThreadAttr_t LEDTimer_attributes = {
  .name = "LEDTimer",
  .priority = (osPriority_t) osPriorityLow,
  .stack_size = 128 * 4
};
/* Definitions for touchRead */
osThreadId_t touchReadHandle;
const osThreadAttr_t touchRead_attributes = {
  .name = "touchRead",
  .priority = (osPriority_t) osPriorityAboveNormal,
  .stack_size = 128 * 4
};
/* Definitions for bleTXqueue */
osMessageQueueId_t bleTXqueueHandle;
const osMessageQueueAttr_t bleTXqueue_attributes = {
  .name = "bleTXqueue"
};
/* Definitions for rtcMutex */
osMutexId_t rtcMutexHandle;
const osMutexAttr_t rtcMutex_attributes = {
  .name = "rtcMutex"
};
/* Definitions for screenTextMutex */
osMutexId_t screenTextMutexHandle;
const osMutexAttr_t screenTextMutex_attributes = {
  .name = "screenTextMutex"
};
/* Definitions for ledStateMutex */
osMutexId_t ledStateMutexHandle;
const osMutexAttr_t ledStateMutex_attributes = {
  .name = "ledStateMutex"
};
/* USER CODE BEGIN PV */


typedef enum {
	LED_NONE,
	LED_OFF,
	LED_TIME,
	LED_TOUCH_TRACK,
	LED_CONFIRM_FLASH,
	LED_SPIRAL,
	LED_OTHER
} LedStatus_t;

typedef struct {
	LedStatus_t currentMode;
	LedStatus_t nextMode;
	TickType_t modeTimeout;
} LedState_t;

LedState_t LedState;
//protected by ledStateMutex

typedef enum {
	SCREEN_OFF,
	SCREEN_TIME,
	SCREEN_TOUCH_TRACK,
	SCREEN_TEXT,
	SCREEN_IMAGE
} ScreenStatus_t;

typedef struct {
	char screenText[128];
	uint8_t screenImage;
	uint8_t len;
} ScreenState_t;

ScreenState_t ScreenState;
//protected by screenTextMutex

/* USER CODE END PV */

