davidbramsay/watch-stm32-main-development/Watch_BLEFreeRTOS_V1/Core/Src/main.c
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_startScreenUpdate */
/**
  * @brief  Function implementing the screenUpdate thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_startScreenUpdate */
void startScreenUpdate(void *argument)
{
  /* USER CODE BEGIN 5 */
  HAL_GPIO_WritePin(OLED_RESET_GPIO_Port, OLED_RESET_Pin, GPIO_PIN_SET);

  uint8_t oled_buf[WIDTH * HEIGHT / 8];

  er_oled_begin();
  er_oled_clear(oled_buf);
  er_oled_string(6, 14, "DRAMSAY", 12, 1, oled_buf);
  er_oled_display(oled_buf);

  osDelay(3000);
  er_oled_clear(oled_buf);
  er_oled_display(oled_buf);


  ScreenStatus_t screenStatus= SCREEN_TIME;
  char screenText[128];
  char time[10];
  uint8_t imageNum;

  /* Infinite loop */
  for(;;)
  {

	  	//wait for someone to update screen state elsewhere and notify
	  	xTaskNotifyWait(0x00, 0x00, &screenStatus, portMAX_DELAY);
	  	switch(screenStatus){

	  			case SCREEN_TIME:
	  				//test time
	  				//er_oled_time("1743");

	  				//only hrmin
	  				get_RTC_hrmin(time);
	  				er_oled_time(time);

	  				//hrminsec
	  				//get_RTC_hrminsec(time);
	  				//er_oled_clear(oled_buf);
	  				//er_oled_string(0, 14, time, 12, 1, oled_buf);
	  				//er_oled_display(oled_buf);

	  				break;

	  			case SCREEN_TOUCH_TRACK:

	  				break;

	  			case SCREEN_IMAGE:

	  				er_oled_clear(oled_buf);

	  				osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
	  				imageNum = ScreenState.screenImage;
	  				osMutexRelease(screenTextMutexHandle);

	  				if (imageNum == 1){er_oled_bitmap(0, 0, PIC1, 72, 40, oled_buf);}
	  				else if (imageNum == 2) {er_oled_bitmap(0, 0, PIC2, 72, 40, oled_buf);}
	  				else {er_oled_string(0, 14, "invalid image number", 24, 1, oled_buf);}

	  				er_oled_display(oled_buf);
	  				osDelay(1000);
	  				command(0xa7);//--set Negative display
	  				osDelay(1000);
	  				command(0xa6);//--set normal display
	  				break;

	  			case SCREEN_TEXT:

	  				osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
	  				strncpy(screenText, ScreenState.screenText, sizeof(ScreenState.screenText));
	  				osMutexRelease(screenTextMutexHandle);
	  				er_oled_clear(oled_buf);
	  				er_oled_string(0, 14, screenText, 12, 1, oled_buf);
	  				er_oled_display(oled_buf);
	  				osDelay(5);
	  				break;

	  			default: //includes SCREEN_OFF
	  				er_oled_clear(oled_buf);
	  				er_oled_display(oled_buf);
	  				break;
	  	}

  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_startLEDControl */
/**
* @brief Function implementing the LEDControl thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startLEDControl */
void startLEDControl(void *argument)
{
  /* USER CODE BEGIN startLEDControl */

  //To call LED behavior:
    //osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
   	//LedState.currentMode = LED_CONFIRM_FLASH;
   	//osMutexRelease(ledStateMutexHandle);

  //For LED to work on new board (multiplexed with SPI_NSS), we need to pull PA4 high
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);


  //LedState Init
  osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
  LedState.currentMode = LED_SPIRAL;
  LedState.nextMode = LED_OFF;
  LedState.modeTimeout = pdMS_TO_TICKS(5000);
  osMutexRelease(ledStateMutexHandle);

  //Dotstar Init
  DotStar_InitHandle dotstar;
  dotstar.spiHandle = &hspi1;
  dotstar.numLEDs = NUM_PIXELS;
  dotstar.colorOrder = DOTSTAR_BGR;
  Dotstar_Init(&dotstar);

  ds_clear();  //turn off
  ds_show();

  const uint8_t STANDARD_BRIGHTNESS = 20; //20, 0-255
  const uint8_t MAX_BRIGHTNESS = 0x33; //max brightness, 0x01-0xFF

  ds_setBrightness(STANDARD_BRIGHTNESS);
  osDelay(1000);

  LedStatus_t currentMode;
  LedStatus_t lastLoopMode = LED_OFF;

  uint16_t counter = 0;
  uint8_t stateVar1 = 0;
  uint8_t stateVar2 = 0;

  uint32_t color = 0x000000;
  /* Infinite loop */
  for(;;)
  {
    //check state, get mode, call timer if necessary

    osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
	currentMode = LedState.currentMode;
	if (LedState.modeTimeout){
		xTaskNotifyGive(LEDTimerHandle);
	}
	osMutexRelease(ledStateMutexHandle);

	//reset count if we've switched modes
	if (lastLoopMode != currentMode) { counter = 0; stateVar1 = 0; stateVar2 = 0;}

	switch(currentMode){

		case LED_TIME:

			break;
		case LED_TOUCH_TRACK:

			break;
		case LED_CONFIRM_FLASH:

			//each color go from 00 to MAX_BRIGHTNESS to 00 over a second, 1000Hz=sec, ~512 steps, 2ms
			if (lastLoopMode != currentMode) { ds_fill(0xFFFFFF, 0, 12);}
		    ds_setBrightness(stateVar1);
			ds_show();

		    //increment color intensity
		    if (stateVar2) {stateVar1--;}
		    else {stateVar1++;}

		    //if we hit a limit switch color scaling up or down
		    if (stateVar1 == MAX_BRIGHTNESS) {stateVar2 = 1;}
		    if (stateVar1 == 0x00) {stateVar2 = 0;}

			osDelay(pdMS_TO_TICKS(2)); //2ms delay

			if (++counter == (MAX_BRIGHTNESS*4)) { //if we hit 1 cycle here (= MAX_BRIGHTNESS*2,could *4 to set to two full cycles), set state to off
				ds_clear();
				ds_show();
				ds_setBrightness(STANDARD_BRIGHTNESS);

				osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
				LedState.currentMode = LED_OFF;
				osMutexRelease(ledStateMutexHandle);
			}

			break;

		case LED_SPIRAL:

			//rotate fixed pattern around 12
			//modulo 12
			for (int i=0; i< NUM_PIXELS; i++){

				if (i==(counter+2)%12){ color = 0xFFFFFF; }
				else if (i==(counter+1)%12){ color = 0xD0D0D0; }
				else if (i==counter)       { color = 0xA0A0A0; }
				else { color = 0x000000; }

				ds_setPixelColor32B(i, color); // 'off' pixel at head
			}

			ds_show();
			counter = (counter+1)%12;
			osDelay(pdMS_TO_TICKS(50));

			break;

		default: //case LED_OTHER, LED_OFF, LED_NONE
			if (lastLoopMode != currentMode) {
				ds_clear();
				ds_show();
			}
			osDelay(250);
			break;
	}

	lastLoopMode = currentMode;
  }
  /* USER CODE END startLEDControl */
}

/* USER CODE BEGIN Header_startButtonPress */
/**
* @brief Function implementing the buttonPress thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startButtonPress */
void startButtonPress(void *argument)
{
  /* USER CODE BEGIN startButtonPress */
  /* Infinite loop */

  //Buttons are PULLED UP and drop to 0 when pressed
  uint8_t buttonState[] = {1, 1, 1};
  uint32_t callingPin = 0x00;

  for(;;)
  {
	//wait for rising or falling edge trigger, put calling pin in callingPin
	xTaskNotifyWait(0x00, 0x00, &callingPin, portMAX_DELAY);

	//check state of pin
	GPIO_PinState first_read = HAL_GPIO_ReadPin(GPIOB, callingPin);

	//wait 50ms
    osDelay(50);

