davidbramsay/watch-stm32-main-development/Watch_BLEFreeRTOS_V1/Core/Src/main.c
    //check again (debounce) to get a good reading
	if (first_read == HAL_GPIO_ReadPin(GPIOB, callingPin)){

		//check that we are actually changing state; the edge trigger should only call
		//when this happens (except during debouncing) so we expect this to be true
		//almost always

		//callingPin can be used as bitmask Pin 5/4/3 give 1000000/10000/1000

		if (callingPin == 0b1000 && first_read != buttonState[0]) { //button 1 trigger
		  //set buttonState
		  buttonState[0] = first_read;

		  //do stuff if button pressed
		  if (!first_read){
			    P2PS_APP_SW1_Button_Action();
		       	osDelay(100);
		  }

		  		    //send BLE queue indicator; button 1 = 0x0
		  		    uint16_t bleval = 0x0000 | ((!first_read) << 8);
		  		    osMessageQueuePut(bleTXqueueHandle, &bleval, 0, 0);
		}
		if (callingPin == 0b10000 && first_read != buttonState[1]) { //button 2 trigger
		    //set buttonState
		    buttonState[1] = first_read;

		    //do stuff if button pressed
		    if (!first_read){
		       	osDelay(100);
		    }

		    //send BLE queue indicator; button 2 = 0x1
		    uint16_t bleval = 0x1000 | ((!first_read) << 8);
		    osMessageQueuePut(bleTXqueueHandle, &bleval, 0, 0);
		}
		if (callingPin == 0b100000 && first_read != buttonState[2]) { //button 3 trigger
		    //set buttonState
		    buttonState[2] = first_read;

		    //do stuff if button pressed
		    if (!first_read){
		    	osDelay(100);
		    }

		    //send BLE queue indicator; button 3 = 0x2
		    uint16_t bleval = 0x2000 | ((!first_read) << 8);
		    osMessageQueuePut(bleTXqueueHandle, &bleval, 0, 0);
		}

	}

  }
  /* USER CODE END startButtonPress */
}

/* USER CODE BEGIN Header_startVibrateControl */
/**
* @brief Function implementing the vibrateControl thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startVibrateControl */
void startVibrateControl(void *argument)
{
  /* USER CODE BEGIN startVibrateControl */

  //HAL_GPIO_WritePin(VIBRATION_GPIO_Port, VIBRATION_Pin, GPIO_PIN_RESET);

  //Init Vibration Motor PWM Parameters
  int duty_cycle = 79; //0 is off, up to ~80
  htim1.Instance->CCR2 = duty_cycle;

  /* Infinite loop */
  for(;;)
  {
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);

    osDelay(2000);

    HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);

    osDelay(2000);

  }
  /* USER CODE END startVibrateControl */
}

/* USER CODE BEGIN Header_startRTCTick */
/**
* @brief Function implementing the rtcSecondTick thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startRTCTick */
void startRTCTick(void *argument)
{
  /* USER CODE BEGIN startRTCTick */

	RTC_TimeTypeDef sTime = {0};
    sTime.Hours      = 0x15;
    sTime.Minutes    = 0x41;
    sTime.Seconds    = 0x57;
    sTime.SubSeconds = 0x0;
    sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
   	sTime.StoreOperation = RTC_STOREOPERATION_RESET;

   	osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK) {
	    Error_Handler();
	}
	osMutexRelease(rtcMutexHandle);

  /* Infinite loop */
  for(;;)
  {
    osDelay(6000);

    osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
    LedState.currentMode = LED_SPIRAL;
    osMutexRelease(ledStateMutexHandle);

    osDelay(3000);

    ScreenStatus_t newScreen = SCREEN_TIME;
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);

    osDelay(3000);

    osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
    LedState.currentMode = LED_CONFIRM_FLASH;
    osMutexRelease(ledStateMutexHandle);

    osDelay(1000);

    osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
    LedState.currentMode = LED_SPIRAL;
    osMutexRelease(ledStateMutexHandle);

    osDelay(3000);

    newScreen = SCREEN_TEXT;
	osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
	strncpy(ScreenState.screenText, "arbitrary", sizeof("arbitrary"));
	osMutexRelease(screenTextMutexHandle);
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);

    osDelay(3000);

    /*
    //set rtc
    RTC_TimeTypeDef sTime = {0};
    sTime.Hours      = 0x15;
    sTime.Minutes    = 0x41;
    sTime.Seconds    = 0x57;
    sTime.SubSeconds = 0x0;
    sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
   	sTime.StoreOperation = RTC_STOREOPERATION_RESET;
   	osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
    if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK) {
        Error_Handler();
    }
    osMutexRelease(rtcMutexHandle);
	*/

    newScreen = SCREEN_TIME;
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);
    osDelay(1000);
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);
    osDelay(1000);
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);
    osDelay(1000);
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);
    osDelay(1000);


    osDelay(1000);

    newScreen = SCREEN_IMAGE;
   	osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
   	ScreenState.screenImage = 1;
   	osMutexRelease(screenTextMutexHandle);
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);

    osDelay(3000);

    newScreen = SCREEN_OFF;
    xTaskNotify(screenUpdateHandle, (uint32_t)newScreen, eSetValueWithOverwrite);


  }
  /* USER CODE END startRTCTick */
}

/* USER CODE BEGIN Header_startBLETX */
/**
* @brief Function implementing the bleTX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLETX */
void startBLETX(void *argument)
{
  /* USER CODE BEGIN startBLETX */
  /* Infinite loop */
  for(;;)
  {
    osDelay(2000);

  }
  /* USER CODE END startBLETX */
}

/* USER CODE BEGIN Header_startBLERX */
/**
* @brief Function implementing the bleRX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLERX */
void startBLERX(void *argument)
{
  /* USER CODE BEGIN startBLERX */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1000);
  }
  /* USER CODE END startBLERX */
}

