davidbramsay/watch-stm32-main-development/Watch_BLEFreeRTOS_V1/Core/Src/main.c
/* USER CODE BEGIN Header_startLEDTimer */
/**
* @brief Function implementing the LEDTimer thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startLEDTimer */
void startLEDTimer(void *argument)
{
  /* USER CODE BEGIN startLEDTimer */

  //this gets called if the timer value in the struct is
  //set to something other than 0 (which should occur using
  //the ledSateMutexHandle to make it atomic).  It will
  //change the currentState to nextState after the timeout
  //in ms IF no state updates have occurred during the waiting
  //period.  Changing current or next state will cause the
  //this timer to stop working.

  //Updating the timeout value when another timeout is active
  //has poorly defined behavior; namely it will wait for the
  //active timeout to finish before it starts counting.

  //This should really be used sparingly to simply call a
  //temporary LED action that should then just fade to
  //another, like a confirm flash followed by off/watch mode.

  LedState_t waitState;

  /* Infinite loop */
  for(;;)
  {
	  //wait until notified
	  ulTaskNotifyTake( pdTRUE, portMAX_DELAY);

	  //pull time of delay before updating LED state
	  osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
	  waitState = LedState;
	  LedState.modeTimeout = 0;
	  osMutexRelease(ledStateMutexHandle);

	  //delay
	  osDelay(waitState.modeTimeout);

	  //update LED state in LedState
	  osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
	  //check that state values haven't changed since
	  //started waiting before updating state
	  if (waitState.currentMode == LedState.currentMode && waitState.nextMode == LedState.nextMode) {
		  LedState.currentMode = LedState.nextMode;
		  LedState.nextMode = LED_NONE;
	  }
	  osMutexRelease(ledStateMutexHandle);
  }
  /* USER CODE END startLEDTimer */
}

/* USER CODE BEGIN Header_startTouchRead */
/**
* @brief Function implementing the touchRead thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startTouchRead */
void startTouchRead(void *argument)
{
  /* USER CODE BEGIN startTouchRead */

  int16_t current_minute = -1;
  uint8_t touch_end_count = 0;
  uint16_t last_minute = -1;
  #define TOUCH_END_TIMEOUT 6

  osDelay(3000); // give screen time to turn on.

  //init peripheral (not turbo mode, poll every 250ms, if touch sample at 40Hz until no touch)
  if (setup_iqs263() == HAL_ERROR) {

	  osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
	  strncpy(ScreenState.screenText, "touch fail", sizeof("touch fail"));
	  osMutexRelease(screenTextMutexHandle);
	  xTaskNotify(screenUpdateHandle, (uint32_t)SCREEN_TEXT, eSetValueWithOverwrite);

  }

  /* Infinite loop */
  for(;;)
  {
   current_minute = iqs263_get_min_if_pressed(); //returns -1 if no press
   if (current_minute != -1) { //touch!

	   touch_end_count = 1;

	   if (last_minute != current_minute) {
		   //update touch stuff!
		   last_minute = current_minute;
	   	   er_oled_print_2digit(current_minute);
	   }

	   //optional
	   osDelay(25);

	   /*
	   char str[3];
	   sprintf(str, "%d", current_minute);
	   osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
	   strncpy(ScreenState.screenText, str, sizeof(str));
	   osMutexRelease(screenTextMutexHandle);
	   xTaskNotify(screenUpdateHandle, (uint32_t)SCREEN_TEXT, eSetValueWithOverwrite);
	   */

   } else if (touch_end_count > 0){

	   touch_end_count += 1;//increment touching_end_count

	   if (touch_end_count >= TOUCH_END_TIMEOUT){  //if it hits this value, we're done

		   touch_end_count = 0;

		   //DO THINGS WITH CONFIRMED TOUCH == LAST_MINUTE
		   osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
		   char out_text[10];
		   sprintf(out_text, "FINAL: %d", last_minute);
		   strncpy(ScreenState.screenText, out_text, sizeof(out_text));
		   osMutexRelease(screenTextMutexHandle);
		   xTaskNotify(screenUpdateHandle, (uint32_t)SCREEN_TEXT, eSetValueWithOverwrite);

		   last_minute = -1;

	   }

	   osDelay(25);


   }else { //no touch, wait for a touch
    osDelay(250);
   }
  }
  /* USER CODE END startTouchRead */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM2 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */

/*
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
   USER CODE BEGIN Callback 0

   USER CODE END Callback 0
  if (htim->Instance == TIM2) {
    HAL_IncTick();
  }
   USER CODE BEGIN Callback 1

   USER CODE END Callback 1
}
*/





void PeriphClock_Config(void)
{
  #if (CFG_USB_INTERFACE_ENABLE != 0)
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };
	RCC_CRSInitTypeDef RCC_CRSInitStruct = { 0 };

	/**
   * This prevents the CPU2 to disable the HSI48 oscillator when
   * it does not use anymore the RNG IP
   */
  LL_HSEM_1StepLock( HSEM, 5 );

  LL_RCC_HSI48_Enable();

	while(!LL_RCC_HSI48_IsReady());

	/* Select HSI48 as USB clock source */
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USB;
	PeriphClkInitStruct.UsbClockSelection = RCC_USBCLKSOURCE_HSI48;
	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

	/*Configure the clock recovery system (CRS)**********************************/

	/* Enable CRS Clock */
	__HAL_RCC_CRS_CLK_ENABLE();

	/* Default Synchro Signal division factor (not divided) */
	RCC_CRSInitStruct.Prescaler = RCC_CRS_SYNC_DIV1;

	/* Set the SYNCSRC[1:0] bits according to CRS_Source value */
	RCC_CRSInitStruct.Source = RCC_CRS_SYNC_SOURCE_USB;

	/* HSI48 is synchronized with USB SOF at 1KHz rate */
	RCC_CRSInitStruct.ReloadValue = RCC_CRS_RELOADVALUE_DEFAULT;
	RCC_CRSInitStruct.ErrorLimitValue = RCC_CRS_ERRORLIMIT_DEFAULT;

	RCC_CRSInitStruct.Polarity = RCC_CRS_SYNC_POLARITY_RISING;

	/* Set the TRIM[5:0] to the default value*/
	RCC_CRSInitStruct.HSI48CalibrationValue = RCC_CRS_HSI48CALIBRATION_DEFAULT;

	/* Start automatic synchronization */
	HAL_RCCEx_CRSConfig(&RCC_CRSInitStruct);
#endif

	return;
}
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

